Repository: harjeb/simple-yacht
Catalog: lib/l10n/app_*.arb
Languages: de, ja, ru, zh

# appTitle
source: Yahtzee Game
de: Yahtzee Spiel
ja: ヤッツィーゲーム
ru: Игра Яхтзы
zh: 快艇骰子

source: Start Game
de: Neues Spiel Starten
ja: 新しいゲームを開始
ru: Начать Новую Игру
zh: 开始游戏

source: Leaderboard
de: Bestenliste
ja: リーダーボード
ru: Таблица Лидеров
zh: 排行榜

source: Settings
de: Einstellungen
ja: 設定
ru: Настройки
zh: 设置

# personalBest
source: Personal Best: {score}
de: Persönliche Bestleistung: {score}
ja: 自己ベスト: {score}
ru: Личный Рекорд: {score}
zh: 个人最佳: {score}

# player
source: Player: {playerName}
de: Spieler: {playerName}
ja: プレイヤー: {playerName}
ru: Игрок: {playerName}
zh: 玩家: {playerName}

# round
source: Round: {currentRound}/{totalRounds}
de: Runde: {currentRound}/{totalRounds}
ja: ラウンド: {currentRound}/{totalRounds}
ru: Раунд: {currentRound}/{totalRounds}
zh: 回合: {currentRound}/{totalRounds}

# rollsLeft
source: Rolls Left: {rolls}
de: Verbleibende Würfe: {rolls}
ja: 残りロール数: {rolls}
ru: Осталось Бросков: {rolls}
zh: 剩余投掷次数: {rolls}

source: GAME OVER
de: SPIEL BEENDET
ja: ゲームオーバー
ru: ИГРА ОКОНЧЕНА
zh: 游戏结束

source: Roll Dice
de: Würfeln
ja: サイコロを振る
ru: Бросить Кости
zh: 掷骰子

source: Scoreboard
de: Punktetabelle
ja: スコアボード
ru: Таблица Очков
zh: 计分板

source: Reset Game
de: Spiel Zurücksetzen
ja: ゲームをリセット
ru: Сбросить Игру
zh: 重置游戏

# nextTurn
source: Next Turn (Select Score First!)
de: Nächster Zug (Wähle zuerst eine Kategorie!)
ja: 次のターン (最初にスコアカテゴリを選択してください!)
ru: Следующий Ход (Сначала выберите категорию!)
zh: 下一回合 (请先选择计分项!)

source: Exit to Home
de: Verlassen zum Startbildschirm
ja: ホームに戻る
ru: Выход в Главное Меню
zh: 退出到主页

source: Aces
de: Einser
ja: エース (1の目)
ru: Единицы
zh: 一点

source: Twos
de: Zweier
ja: 2の目
ru: Двойки
zh: 二点

source: Threes
de: Dreier
ja: 3の目
ru: Тройки
zh: 三点

source: Fours
de: Vierer
ja: 4の目
ru: Четверки
zh: 四点

source: Fives
de: Fünfer
ja: 5の目
ru: Пятерки
zh: 五点

source: Sixes
de: Sechser
ja: 6の目
ru: Шестерки
zh: 六点

source: Three of a Kind
de: Drilling
ja: スリーカード
ru: Три одинаковых
zh: 三条

source: Four of a Kind
de: Vierling
ja: フォーカード
ru: Каре
zh: 四条

source: Full House
ja: フルハウス
ru: Фулл-хаус
zh: 葫芦

source: Small Straight
de: Kleine Straße
ja: スモールストレート
ru: Малый Стрейт
zh: 小顺子

source: Large Straight
de: Große Straße
ja: ラージストレート
ru: Большой Стрейт
zh: 大顺子

source: Yahtzee
ja: ヤッツィー
ru: Яхтзы
zh: Yahtzee (快艇)

source: Chance
ja: チャンス
ru: Шанс
zh: 机会

# upperBonus
source: Upper Bonus (if >= 63)
de: Bonus Oberer Teil (wenn >= 63)
ja: アッパーセクションボーナス (63点以上の場合)
ru: Верхний Бонус (если >= 63)
zh: 上区奖励 (如果 >= 63)

source: Upper Subtotal
de: Zwischensumme Oberer Teil
ja: アッパーセクション小計
ru: Верхняя Промежуточная Сумма
zh: 上区小计

source: Upper Total
de: Gesamt Oberer Teil
ja: アッパーセクション合計
ru: Верхний Итог
zh: 上区总计

source: Lower Total
de: Gesamt Unterer Teil
ja: ロワーセクション合計
ru: Нижний Итог
zh: 下区总计

source: Yahtzee Bonus Score
de: Yahtzee Bonus Punkte
ja: ヤッツィーボーナススコア
ru: Бонусные Очки Яхтзы
zh: Yahtzee 奖励分

source: Grand Total
de: Gesamtsumme
ja: 総計
ru: Общий Итог
zh: 总计

source: Dice
de: Würfel
ja: サイコロ
ru: Кости
zh: 骰子

# selectScoreCategoryPrompt
source: Turn Advanced. Select a score category.
de: Zug fortgeschritten. Wähle eine Punktekategorie.
ja: ターンが進みました。スコアカテゴリを選択してください。
ru: Ход завершен. Выберите категорию для записи очков.
zh: 回合结束。请选择一个计分项。

source: Leaderboard (Coming Soon)
de: Bestenliste (Demnächst verfügbar)
ja: リーダーボード (近日公開)
ru: Таблица Лидеров (Скоро)
zh: 排行榜 (敬请期待)

source: Settings (Coming Soon)
de: Einstellungen (Demnächst verfügbar)
ja: 設定 (近日公開)
ru: Настройки (Скоро)
zh: 设置 (敬请期待)

# upperSectionTitle
source: Upper Section
de: Oberer Bereich
ja: 上部セクション
ru: Верхняя Секция
zh: 上部得分

# lowerSectionTitle
source: Lower Section
de: Unterer Bereich
ja: 下部セクション
ru: Нижняя Секция
zh: 下部得分

source: Continue Game
de: Spiel fortsetzen
ja: ゲームを続ける
ru: Продолжить игру
zh: 继续游戏

# exitGameConfirmation
source: Are you sure you want to exit the current game?
de: Sind Sie sicher, dass Sie das aktuelle Spiel verlassen möchten?
ja: 現在のゲームを終了してもよろしいですか？
ru: Вы уверены, что хотите выйти из текущей игры?
zh: 您确定要退出当前游戏吗？

# leaderboardTitle
source: Leaderboard
zh: 排行榜

# leaderboardEmpty
source: The leaderboard is currently empty. Play a game to get on the board!
zh: 排行榜当前为空。进行一场游戏来上榜吧！

# leaderboardScoreDate
source: Score: {score} Date: {date}
zh: 分数: {score} 日期: {date}

# leaderboardScorePoints
source: {score} pts
zh: {score} 分

# leaderboardError
source: Error loading leaderboard: {errorDetails}
zh: 加载排行榜错误: {errorDetails}

# leaderboardRefreshTooltip
source: Refresh Leaderboard
zh: 刷新排行榜

# usernameSetupTitle
source: Set Your Username
zh: 设置您的用户名

# usernameSetupPrompt
source: Please enter a username to be displayed on the leaderboard.
zh: 请输入一个用户名，它将显示在排行榜上。

# usernameLabel
source: Username
zh: 用户名

# usernameHint
source: Enter your desired username
zh: 输入您想要的用户名

source: Username cannot be empty.
zh: 用户名不能为空。

# usernameValidationError
source: Please enter a username.
zh: 请输入用户名。

# usernameTooShortError
source: Username must be at least 3 characters long.
zh: 用户名长度至少为3个字符。

# usernameTooLongError
source: Username cannot be more than 15 characters long.
zh: 用户名长度不能超过15个字符。

# saveButtonLabel
source: Save
zh: 保存

# highScoreDisplay
source: High Score
de: Höchstpunktzahl
ru: Лучший Результат
zh: 最高分

# yourPersonalBestScoreLabel
source: Your Personal Best
de: Deine Persönliche Bestleistung
ru: Ваш Личный Рекорд
zh: 您的个人最佳

# noPersonalBestScore
source: No personal best score yet. Play a game!
de: Noch keine persönliche Bestleistung. Spiel ein Spiel!
ru: Личного рекорда пока нет. Сыграйте игру!
zh: 暂无个人最佳成绩，快来玩一局吧！

# scoreLabel
source: Score
de: Punktzahl
ru: Счет
zh: 分数

# dateTimeLabel
source: Date/Time
de: Datum/Zeit
ru: Дата/Время
zh: 日期/时间

# authenticationError
source: Authentication error. Please restart the app.
zh: 认证失败，请重启应用。

# failedToSaveUsername
source: Failed to save username. Please try again.
zh: 保存用户名失败，请重试。

# genericError
source: An unexpected error occurred. Please try again.
zh: 发生未知错误，请重试。

# recoveryCodeInvalid
source: Invalid or expired recovery code.
zh: 无效或已过期的引继码。

# recoveryFailedError
source: Account recovery failed.
zh: 账户恢复失败。

# recoverySignInFailed
source: Failed to sign in after recovery.
zh: 恢复后登录失败。

# accountRecoveryTitle
source: Recover Account
zh: 恢复账户

# enterRecoveryCodePrompt
source: Enter your 18-character recovery code.
zh: 请输入您的18位引继码。

# recoveryCodeLabel
source: Recovery Code
zh: 引继码

# recoveryCodeHint
source: e.g., ABCDE12345FGHIJ678
zh: 例如：ABCDE12345FGHIJ678

source: Recovery code cannot be empty.
zh: 引继码不能为空。

# recoveryCodeInvalidLength
source: Recovery code must be 18 characters.
zh: 引继码必须是18位字符。

# recoverAccountButtonLabel
source: Recover Account
zh: 恢复账户

# switchToRecoverAccountLabel
source: Have a recovery code? Recover account.
zh: 已有引继码？恢复账户。

# switchToCreateAccountLabel
source: New user? Create an account.
zh: 新用户？创建账户。

# languageSettingsLabel
source: Language Settings
zh: 语言设置

# selectLanguageLabel
source: Select Language
zh: 选择语言

# accountSectionTitle
source: Account Management
zh: 账户管理

# recoveryCodeNotAvailable
source: Recovery code not available. Please ensure your account is set up.
zh: 引继码不可用。请确保您的账户已设置。

source: Your Recovery Code:
zh: 您的引继码：

# copyRecoveryCode
source: Copy Code
zh: 复制引继码

# recoveryCodeCopied
source: Recovery code copied to clipboard!
zh: 引继码已复制到剪贴板！

# deleteAccountButtonLabel
source: Delete Account
zh: 删除账户

# deleteAccountDialogTitle
source: Delete Account?
zh: 删除账户？

# deleteAccountDialogContent
source: Are you sure you want to delete your account? This action is irreversible and all your data (username, scores, etc.) will be lost.
zh: 您确定要删除您的账户吗？此操作不可逆，您的所有数据（用户名、分数等）都将丢失。

# confirmButtonLabel
source: Confirm
zh: 确认

# deleteAccountSuccess
source: Account deleted successfully.
zh: 账户删除成功。

# deleteAccountError
source: Failed to delete account. Please try again.
zh: 删除账户失败，请重试。

# genericErrorWithDetails
source: Error: {details}
zh: 错误：{details}

# loadingLabel
source: Loading...
zh: 加载中...

# errorLabel
source: Error
zh: 错误

# retryButtonLabel
source: Retry
zh: 重试

# signInFailedGeneric
source: Sign-in failed. Please try again.
zh: 登录失败，请检查您的网络连接并稍后重试。

# firestoreDatabaseNotConfiguredError
source: Backend database is not configured. Please contact administrator.
zh: 后端数据库未配置，请联系管理员。

source: Score saved to leaderboard!
zh: Score saved to leaderboard! (NEEDS ZH TRANSLATION)

source: Failed to save score
zh: Failed to save score (NEEDS ZH TRANSLATION)

source: Fix
zh: Fix (NEEDS ZH TRANSLATION)

source: Score saved using locally stored username.
zh: Score saved using locally stored username. (NEEDS ZH TRANSLATION)

source: Username not found. Score not saved.
zh: Username not found. Score not saved. (NEEDS ZH TRANSLATION)

# errorRetrievingUsername
source: Error retrieving username: {details}
zh: Error retrieving username: {details} (NEEDS ZH TRANSLATION)

source: Error fetching username
zh: Error fetching username (NEEDS ZH TRANSLATION)

# invalidGameStateRedirecting
source: Invalid game state. Redirecting to home...
zh: 无效的游戏状态。正在重定向到主页...

# clearLocalDataDialogTitle
source: Clear Local Data?
zh: 清空本地数据？

# clearLocalDataDialogContent
source: This action will remove your account information, game progress, and settings from this device. Your account itself will not be deleted, and you can still recover it using your recovery code on any device. Are you sure you want to proceed?
zh: 此操作将从此设备上移除您的账户信息、游戏进度和设置。您的账户本身不会被删除，您仍可以使用引继码在任何设备上恢复它。确定要继续吗？

# confirmClearButtonLabel
source: Confirm Clear
zh: 确认清除

# clearLocalDataButtonLabel
source: Clear Account Data on This Device
zh: 清空此设备上的账户数据

# clearLocalDataSuccessMessage
source: Local data has been successfully cleared.
zh: 本地数据已成功清除。

# clearLocalDataErrorMessage
source: Failed to clear local data
zh: 清除本地数据失败

source: Multiplayer Lobby
zh: 多人游戏大厅

source: Quick Match
zh: 快速匹配

source: Create Room
zh: 创建房间

source: Join Room
zh: 加入房间

# onlinePlayers
source: Online Players: {count}
zh: 在线玩家: {count}

source: Room Code
zh: 房间码

# waitingForPlayers
source: Waiting for players to join...
zh: 等待玩家加入...

source: Game starting
zh: 游戏即将开始

source: Your turn
zh: 轮到你了

# opponentTurn
source: Opponent's turn
zh: 对手回合

source: Multiplayer Game
zh: 双人游戏

# playerReady
source: Ready
zh: 准备就绪

# playerNotReady
source: Not Ready
zh: 未准备

source: Leave Room
zh: 离开房间

# roomHost
source: Host
zh: 房主

source: Copy Room Code
zh: 复制房间码

source: Room code copied
zh: 房间码已复制

source: Enter room code
zh: 输入房间码

source: Invalid room code
zh: 无效的房间码

source: Room not found
zh: 房间不存在

source: Connection lost
zh: 连接断开

source: Reconnecting...
zh: 正在重连...

source: Game Result
zh: 游戏结果

source: You Win!
zh: 你赢了！

source: You Lose
zh: 你输了

# gameDraw
source: Draw
zh: 平局

source: Play Again
zh: 再玩一局

source: Back to Lobby
zh: 返回大厅
